#include <math.h>
#include <stdio.h>

int main(void) {
  float A = 0.0;
  float B = 0.0;

  printf("Δώσε τιμή στο Α:");
  scanf("%f", &A);
  printf("Δώσε τιμή στο Β:");
  scanf("%f", &B);

  //  Το άθροισμα, τη διαφορά, το γινόμενο, το πηλίκο και το υπόλοιπο της
  //  διαίρεσης των δύο αριθμών.
  printf("άθροισμα %f\n", A + B);
  printf("διαφορά %f\n", A - B);
  printf("γινόμενο %f\n", A * B);
  printf("διαίρεση %f\n", A / B);

  // 	Το πραγματικό πηλίκο των δύο αριθμών.
  printf("πηλίκο %f\n", (float)fmod((double)A, (double)B));

  // 	Το τετράγωνο του πρώτου αριθμού και την τετραγωνική ρίζα του δεύτερου.
  printf("Τετράγωνο του Α: %f, Τετραγωνική ρίζα του B: %f\n", A * A, sqrtf(B));
}
