#include <math.h>
#include <stdio.h>
int main(void) {
  // Έχουμε τους συντελεστές a, b, c, την Διακρίνουσα
  // (D=Discriminant) και τις πιθανές λύσεις
  double a, b, c, D, x1, x2;
  printf("Πληκτρολογήστε τους συντελεστές α, β, γ ενός τριωνύμου: ");
  scanf("%lf %lf %lf", &a, &b, &c);

  // Υπολογισμός της Διακρίνουσας
  D = pow(b, 2) - 4 * a * c;
  if (D < 0) {
    printf("Η Διακρίνουσα είναι μικρότερη του μηδενός (Δ = %lf < 0) και "
           "συνεπώς δεν υπάρχουν πραγματικές ρίζες.\n",
           D);
  } else if (D > 0) {
    printf("Η Διακρίνουσα είναι μεγαλύτερη του μηδενός (Δ = %lf > 0) και "
           "συνεπώς υπάρχουν δύο πραγματικές ρίζες.\n",
           D);

    // Εύρεση ριζουσών
    x1 = (-b + sqrt(D)) / (2 * a);
    x2 = (-b - sqrt(D)) / (2 * a);
    printf("Οι ρίζες του τριωνύμου είναι %lf και %lf.\n", x1, x2);
  } else {
    printf("Η Διακρίνουσα είναι ίση με το μηδέν (Δ = 0) και συνεπώς υπάρχει "
           "μία διπλή ρίζα.\n");
    // Εύρεση της ρίζας
    x1 = -b / (2 * a);
    printf("Η ρίζα του τριωνύμου είναι %lf.\n", x1);
  }
  return 0;
}
