[
  "obsidian-linter",
  "obsidian-pandoc",
  "omnisearch",
  "highlightr-plugin",
  "obsidian-dictionary-plugin",
  "obsidian-hider",
  "obsidian-languagetool-plugin",
  "editing-toolbar",
  "obsidian-tabs",
  "obsidian-vimrc-support",
  "obsidian-collapse-all-plugin",
  "theme-picker",
  "obsidian-epub-plugin",
  "obsidian-excalidraw-plugin"
]