#!/bin/bash


args="${#@}"
echo $args

# $0 πχ 700

if [[ $args == '0' || $args == '1' ]]; then
  echo "Λάθος χρήση σημαίων"
  echo "Χρήση ./script octal_permissions number_of_days"
  exit 
fi

arg1=$1 
arg2=$2

dir=""

read -p "Δώσε όνομα directory: " dir 

if [[ $dir == "" ]]; then
  echo "Πρέπει να δώσεις κάποιο όνομα"
  exit 
fi && [ ! -d $dir ] && echo "Το directory δεν υπάρχει."

# 1. Τα αρχεία του δέντρου του δοθέντος καταλόγου με εξουσιοδοτήσεις (permissions) τον πρώτο
# αριθμό (όρισμα) θεωρώντας τον ως οκταδικό ισοδύναμο.
echo "#### ASKHSH 1 #####"
find $dir -type f -perm $1

echo -e "Γραμμές:" 
find $dir -type f -perm $1 | wc -l 


# 2. Τα αρχεία του δέντρου του δοθέντος καταλόγου που άλλαξαν (modify) περιεχόμενα κατά τις
# ‘x’ τελευταίες μέρες, όπου ‘x’ ο δεύτερος αριθμός (όρισμα).
echo "#### ASKHSH 2 #####"
find $dir -type f -mtime -$2  

# 3. Τους υποκαταλόγους του δέντρου του δοθέντος καταλόγου που προσπελάστηκαν (access)
# κατά τις ‘x’ τελευταίες μέρες, όπου ‘x’ ο δεύτερος αριθμός (όρισμα).
echo "#### ASKHSH 2 #####"
find $dir -atime -$2

# 4. Τα αρχεία του δοθέντος καταλόγου στα οποία έχουν δικαίωμα ανάγνωσης όλοι οι χρήστες.
echo "#### ASKHSH 3 #####"
ls -l $dir | grep -E "^.rw" 

#5. Τους υποκαταλόγους του δοθέντος καταλόγου στους οποίους έχουν δικαίωμα αλλαγών
#(create/rename/delete files) εκτός από τον ιδιοκτήτη και άλλοι χρήστες του συστήματος.
echo "#### ASKHSH 4 #####"
ls -l $dir | grep -E "^d.w..w..w"
